{"class_name": "Model", "keras_version": "1.1.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 65], "input_dtype": "float32", "sparse": false, "name": "input_4"}, "inbound_nodes": [], "name": "input_4"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "input_dtype": "float32", "sparse": false, "name": "input_5"}, "inbound_nodes": [], "name": "input_5"}, {"class_name": "Embedding", "config": {"trainable": true, "name": "embedding_4", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 27, "batch_input_shape": [null, 65], "W_regularizer": null, "dropout": 0.0, "output_dim": 64, "input_length": 65}, "inbound_nodes": [[["input_4", 0, 0]]], "name": "embedding_4"}, {"class_name": "Embedding", "config": {"trainable": true, "name": "embedding_5", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 27, "batch_input_shape": [null, 4], "W_regularizer": null, "dropout": 0.0, "output_dim": 64, "input_length": 4}, "inbound_nodes": [[["input_5", 0, 0]]], "name": "embedding_5"}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_4"}, "inbound_nodes": [[["embedding_4", 0, 0]]], "name": "dropout_4"}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_5"}, "inbound_nodes": [[["embedding_5", 0, 0]]], "name": "dropout_5"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 65], "input_dtype": "float32", "sparse": false, "name": "input_6"}, "inbound_nodes": [], "name": "input_6"}, {"class_name": "Merge", "config": {"name": "merge_4", "concat_axis": -1, "mode_type": "raw", "dot_axes": [2, 2], "mode": "dot", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["dropout_4", 0, 0], ["dropout_5", 0, 0]]], "name": "merge_4"}, {"class_name": "Embedding", "config": {"trainable": true, "name": "embedding_6", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 27, "batch_input_shape": [null, 65], "W_regularizer": null, "dropout": 0.0, "output_dim": 4, "input_length": 65}, "inbound_nodes": [[["input_6", 0, 0]]], "name": "embedding_6"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["merge_4", 0, 0]]], "name": "activation_3"}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_6"}, "inbound_nodes": [[["embedding_6", 0, 0]]], "name": "dropout_6"}, {"class_name": "Merge", "config": {"name": "merge_5", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_3", 0, 0], ["dropout_6", 0, 0]]], "name": "merge_5"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_2"}, "inbound_nodes": [[["merge_5", 0, 0]]], "name": "permute_2"}, {"class_name": "Merge", "config": {"name": "merge_6", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["permute_2", 0, 0], ["dropout_5", 0, 0]]], "name": "merge_6"}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "lstm_2", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 129, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "output_dim": 32, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["merge_6", 0, 0]]], "name": "lstm_2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 27}, "inbound_nodes": [[["lstm_2", 0, 0]]], "name": "dense_2"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_4"}, "inbound_nodes": [[["dense_2", 0, 0]]], "name": "activation_4"}], "input_layers": [["input_4", 0, 0], ["input_5", 0, 0], ["input_6", 0, 0]], "output_layers": [["activation_4", 0, 0]], "name": "model_2"}}